blog/2013-06-21-linkfest.org
#+TITLE: Weekend Linkfest 21.6.2013
#+DATE: 2013-06-21
#+SETUPFILE: ~/Dropbox/octopress/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Linkfest
#+JEKYLL_PUBLISHED: true
#+OPTIONS: toc:nil num:nil
I was very busy, so I skipped two linkfests. Here is a long one this week!
* Statistics and Machine Learning
- [[https://raw.github.com/CamDavidsonPilon/Probabilistic-Programming-and-Bayesian-Methods-for-Hackers/master/PDF/June82013.pdf][Probabilistic Programming and Bayesian Methods for Hackers]]
- [[-%20%5B%5Bhttp://www.johndcook.com/blog/2013/06/12/example-of-unit-testing-r-code-with-testthat/%5D%5BFeature%20Hashing%20|%20TechTalks.tv%5D%5D][Feature Hashing | TechTalks.tv]]
- [[http://arxiv.org/abs/1306.2861][Bayesian Inference and Learning in Gaussian Process State-Space Models with Particle MCMC]]
- [[http://googleresearch.blogspot.de/2013/06/excellent-papers-for-2012.html][Excellent Google Papers for 2012]]
- [[http://about.wise.io/blog/2013/06/06/principles-of-ml-benchmarking/][Principles of ML Benchmarking]]
- [[http://kieranhealy.org//blog/archives/2013/06/09/using-metadata-to-find-paul-revere/][Using Metadata to find Paul Revere - Kieran Healy]]
- [[http://nlp.stanford.edu/courses/NAACL2013/][Deep Learning Tutorial - NAACL 2013]]
- [[http://normaldeviate.wordpress.com/2013/06/09/the-value-of-adding-randomness/][The Value of Adding Randomness « Normal Deviate]]
- [[http://sugiyama-www.cs.titech.ac.jp/~sugi/2009/LargeScaleKernel.pdf][Recent Advances and Trends in Large Scale Kernel Methods]]
- [[http://m.sciencemag.org/content/340/6137/1177.short][Bayes' Theorem in the 21st Century]]
- [[http://www.statistics.com/glossary/][Statistics.com - Glossary of statistical terms]]
- [[http://r4stats.com/2013/05/29/sas-dominates-analytics-jobs/][SAS Dominates Analytics Job Market; R up 42% | r4stats.com]]
- [[http://simplystatistics.org/2013/05/29/what-statistics-should-do-about-big-data-problem-forward-not-solution-backward/][What statistics should do about big data: problem forward not solution backward | Simply Statistics]]
- [[http://home.comcast.net/~tom.fawcett/public_html/ML-gallery/pages/][Machine learning classifier gallery]]
- [[http://shapeofdata.wordpress.com/2013/06/18/neural-networks-2-evaluation/][Neural Networks 2: Evaluation | The Shape of Data]]
- [[http://normaldeviate.wordpress.com/2013/06/20/simpsons-paradox-explained/][SIMPSON’S PARADOX EXPLAINED « Normal Deviate]]
- [[http://jmlr.org/proceedings/papers/v28/wang13a.pdf][Fast dropout training]]
- [[http://benhamner.com/icml2013preview/#/][ICML 2013 Papers]]
- [[http://datascience101.wordpress.com/2013/06/11/deep-learning-a-term-to-know/][Deep Learning – A Term To Know | Data Science 101]]
* R Package of the Week
- [[http://cran.r-project.org/web/packages/testthat/index.html][testthat]]
* Paper of the Week
- [[http://arxiv.org/pdf/0902.2206.pdf][Feature Hashing for Large Scale Multitask Learning]]
- [[http://jmlr.org/proceedings/papers/v28/izbicki13.pdf][Algebraic classifiers: a generic approach to fast cross-validation, online training, and parallel training]]
* Programming
- [[http://gastonsanchez.wordpress.com/2013/06/01/visualizing-correlations-with-corrgrams/][Visualizing Correlations with Corrgrams | Data Analysis Visually Enforced]]
- [[http://www.johndcook.com/blog/2013/06/12/example-of-unit-testing-r-code-with-testthat/][Example of unit testing R code with testthat | The Endeavour]]
- [[https://hips.seas.harvard.edu/blog/2013/05/20/testing-mcmc-code-part-1-unit-tests/][Testing MCMC code, part 1: unit tests – Building Intelligent Probabilistic Systems]]
- [[https://hips.seas.harvard.edu/blog/2013/06/10/testing-mcmc-code-part-2-integration-tests/][Testing MCMC code, part 2: integration tests – Building Intelligent Probabilistic Systems]]
- [[http://procomun.wordpress.com/2013/06/13/displaying-spatial-time/][More code and images from “Displaying time series, spatial and space-time data with R”]]
- [[http://gigaom.com/2013/06/17/want-cheap-high-performance-computing-at-scale-like-google-look-to-gpus/][Want cheap high-performance computing at scale like Google? Look to GPUs]]
- [[http://continuum.io/blog/ipcluster-wakari-intro][Parallel Python with IPCluster and Wakari]]
- [[http://altons.github.io/machine%2520learning/2013/06/17/libsvm-101/][LIBSVM 101]]
- [[http://blog.quandl.com/blog/using-quandl-in-r/][Using Quandl in R]]
- [[http://blog.mikiobraun.de/2013/06/real-time-big-data-landscape.html][Marginally Interesting: The Real-Time Big Data Landscape]]
- [[http://drunks-and-lampposts.com/2013/06/09/mahout-for-r-users/][Mahout for R Users | Drunks&Lampposts]]
- [[http://izbicki.me/blog/hlearn-cross-validates-400x-faster-than-weka][HLearn cross-validates >400x faster than Weka]]
- [[http://felsin9.de/nnis/ghc-vis/][The ghc-vis User Guide]]
- [[https://nose.readthedocs.org/en/latest/][Installation and quick start — nose 1.3.0 documentation]]
- [[http://codealamode.blogspot.de/2013/06/drawing-dags-latex-solution.html][Code à la Mode: Drawing DAGs: LaTeX Solution]]
- [[http://blog.yhathq.com/posts/recommender-system-in-r.html][Recomendation System in R]]
- [[http://rcharts.io/][rCharts]]
- [[http://fastml.com/go-non-linear-with-vowpal-wabbit/][Go non-linear with Vowpal Wabbit - FastML]]
- [[http://www.dehora.net/journal/2013/06/15/on-scala/][On Scala]]
- [[http://timelyportfolio.blogspot.de/2013/06/r-plotting-financial-time-series.html?spref%3Dtw][Timely Portfolio: R Plotting Financial Time Series]]
- [[http://metarabbit.wordpress.com/2013/05/31/building-machine-learning-systems-with-python/][Building Machine Learning Systems with Python | Meta Rabbit]]
- [[http://statcompute.wordpress.com/2013/06/09/improve-the-efficiency-in-joining-data-with-index/][Improve The Efficiency in Joining Data with Index | Yet Another Blog in Statistical Computing]]
- [[http://izbicki.me/blog/hlearns-code-is-shorter-and-clearer-than-wekas][HLearn's code is shorter and clearer than Weka's]]
* Elsewhere
- [[https://vimeo.com/67076984][Media for Thinking the Unthinkable on Vimeo]]
