blog/2013-06-21-linkfest.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 21.6.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="I was very busy, so I skipped two linkfests. Here is a long one this week! Statistics and Machine Learning Probabilistic Programming and Bayesian &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 21.6.2013</h2>
	<div class="entry-content"><p>
I was very busy, so I skipped two linkfests. Here is a long one this week!
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://raw.github.com/CamDavidsonPilon/Probabilistic-Programming-and-Bayesian-Methods-for-Hackers/master/PDF/June82013.pdf">Probabilistic Programming and Bayesian Methods for Hackers</a>
</li>
<li><a href="http://www.johndcook.com/blog/2013/06/12/example-of-unit-testing-r-code-with-testthat/][Feature Hashing | TechTalks.tv]]">Feature Hashing | TechTalks.tv</a>
</li>
<li><a href="http://arxiv.org/abs/1306.2861">Bayesian Inference and Learning in Gaussian Process State-Space Models with Particle MCMC</a>
</li>
<li><a href="http://googleresearch.blogspot.de/2013/06/excellent-papers-for-2012.html">Excellent Google Papers for 2012</a>
</li>
<li><a href="http://about.wise.io/blog/2013/06/06/principles-of-ml-benchmarking/">Principles of ML Benchmarking</a>
</li>
<li><a href="http://kieranhealy.org//blog/archives/2013/06/09/using-metadata-to-find-paul-revere/">Using Metadata to find Paul Revere - Kieran Healy</a>
</li>
<li><a href="http://nlp.stanford.edu/courses/NAACL2013/">Deep Learning Tutorial - NAACL 2013</a>
</li>
<li><a href="http://normaldeviate.wordpress.com/2013/06/09/the-value-of-adding-randomness/">The Value of Adding Randomness « Normal Deviate</a>
</li>
<li><a href="http://sugiyama-www.cs.titech.ac.jp/~sugi/2009/LargeScaleKernel.pdf">Recent Advances and Trends in Large Scale Kernel Methods</a>
</li>
<li><a href="http://m.sciencemag.org/content/340/6137/1177.short">Bayes&#8217; Theorem in the 21st Century</a>
</li>
<li><a href="http://www.statistics.com/glossary/">Statistics.com - Glossary of statistical terms</a>
</li>
<li><a href="http://r4stats.com/2013/05/29/sas-dominates-analytics-jobs/">SAS Dominates Analytics Job Market; R up 42% | r4stats.com</a>
</li>
<li><a href="http://simplystatistics.org/2013/05/29/what-statistics-should-do-about-big-data-problem-forward-not-solution-backward/">What statistics should do about big data: problem forward not solution backward | Simply Statistics</a>
</li>
<li><a href="http://home.comcast.net/~tom.fawcett/public_html/ML-gallery/pages/">Machine learning classifier gallery</a>
</li>
<li><a href="http://shapeofdata.wordpress.com/2013/06/18/neural-networks-2-evaluation/">Neural Networks 2: Evaluation | The Shape of Data</a>
</li>
<li><a href="http://normaldeviate.wordpress.com/2013/06/20/simpsons-paradox-explained/">SIMPSON’S PARADOX EXPLAINED « Normal Deviate</a>
</li>
<li><a href="http://jmlr.org/proceedings/papers/v28/wang13a.pdf">Fast dropout training</a>
</li>
<li><a href="http://benhamner.com/icml2013preview/#/">ICML 2013 Papers</a>
</li>
<li><a href="http://datascience101.wordpress.com/2013/06/11/deep-learning-a-term-to-know/">Deep Learning – A Term To Know | Data Science 101</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/testthat/index.html">testthat</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://arxiv.org/pdf/0902.2206.pdf">Feature Hashing for Large Scale Multitask Learning</a>
</li>
<li><a href="http://jmlr.org/proceedings/papers/v28/izbicki13.pdf">Algebraic classifiers: a generic approach to fast cross-validation, online training, and parallel training</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://gastonsanchez.wordpress.com/2013/06/01/visualizing-correlations-with-corrgrams/">Visualizing Correlations with Corrgrams | Data Analysis Visually Enforced</a>
</li>
<li><a href="http://www.johndcook.com/blog/2013/06/12/example-of-unit-testing-r-code-with-testthat/">Example of unit testing R code with testthat | The Endeavour</a>
</li>
<li><a href="https://hips.seas.harvard.edu/blog/2013/05/20/testing-mcmc-code-part-1-unit-tests/">Testing MCMC code, part 1: unit tests – Building Intelligent Probabilistic Systems</a>
</li>
<li><a href="https://hips.seas.harvard.edu/blog/2013/06/10/testing-mcmc-code-part-2-integration-tests/">Testing MCMC code, part 2: integration tests – Building Intelligent Probabilistic Systems</a>
</li>
<li><a href="http://procomun.wordpress.com/2013/06/13/displaying-spatial-time/">More code and images from “Displaying time series, spatial and space-time data with R”</a>
</li>
<li><a href="http://gigaom.com/2013/06/17/want-cheap-high-performance-computing-at-scale-like-google-look-to-gpus/">Want cheap high-performance computing at scale like Google? Look to GPUs</a>
</li>
<li><a href="http://continuum.io/blog/ipcluster-wakari-intro">Parallel Python with IPCluster and Wakari</a>
</li>
<li><a href="http://altons.github.io/machine%20learning/2013/06/17/libsvm-101/">LIBSVM 101</a>
</li>
<li><a href="http://blog.quandl.com/blog/using-quandl-in-r/">Using Quandl in R</a>
</li>
<li><a href="http://blog.mikiobraun.de/2013/06/real-time-big-data-landscape.html">Marginally Interesting: The Real-Time Big Data Landscape</a>
</li>
<li><a href="http://drunks-and-lampposts.com/2013/06/09/mahout-for-r-users/">Mahout for R Users | Drunks&amp;Lampposts</a>
</li>
<li><a href="http://izbicki.me/blog/hlearn-cross-validates-400x-faster-than-weka">HLearn cross-validates &gt;400x faster than Weka</a>
</li>
<li><a href="http://felsin9.de/nnis/ghc-vis/">The ghc-vis User Guide</a>
</li>
<li><a href="https://nose.readthedocs.org/en/latest/">Installation and quick start — nose 1.3.0 documentation</a>
</li>
<li><a href="http://codealamode.blogspot.de/2013/06/drawing-dags-latex-solution.html">Code à la Mode: Drawing DAGs: LaTeX Solution</a>
</li>
<li><a href="http://blog.yhathq.com/posts/recommender-system-in-r.html">Recomendation System in R</a>
</li>
<li><a href="http://rcharts.io/">rCharts</a>
</li>
<li><a href="http://fastml.com/go-non-linear-with-vowpal-wabbit/">Go non-linear with Vowpal Wabbit - FastML</a>
</li>
<li><a href="http://www.dehora.net/journal/2013/06/15/on-scala/">On Scala</a>
</li>
<li><a href="http://timelyportfolio.blogspot.de/2013/06/r-plotting-financial-time-series.html?spref=tw">Timely Portfolio: R Plotting Financial Time Series</a>
</li>
<li><a href="http://metarabbit.wordpress.com/2013/05/31/building-machine-learning-systems-with-python/">Building Machine Learning Systems with Python | Meta Rabbit</a>
</li>
<li><a href="http://statcompute.wordpress.com/2013/06/09/improve-the-efficiency-in-joining-data-with-index/">Improve The Efficiency in Joining Data with Index | Yet Another Blog in Statistical Computing</a>
</li>
<li><a href="http://izbicki.me/blog/hlearns-code-is-shorter-and-clearer-than-wekas">HLearn&#8217;s code is shorter and clearer than Weka&#8217;s</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Elsewhere</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://vimeo.com/67076984">Media for Thinking the Unthinkable on Vimeo</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-06-21T00:00:00+02:00" pubdate data-updated="true">Jun 21<span>st</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>